In [3]:
%load_ext sql
%sql mysql+mysqlconnector://root:Root@localhost/

In [4]:
%%sql
drop table if exists students;
CREATE DATABASE students;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1046 (3D000): No database selected
[SQL: drop table if exists students;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
USE students;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [12]:
%%sql
drop table if exists students;
CREATE TABLE students (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    grade VARCHAR(5)
);
INSERT INTO students (name, age, grade) VALUES
('Arjun', 20, 'A'),
('Meena', 21, 'B'),
('Karthik', 19, 'A'),
('Priya', 22, 'C');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
4 rows affected.

[]

In [13]:
%%sql
select * from students;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'Arjun', 20, 'A'),
 (2, 'Meena', 21, 'B'),
 (3, 'Karthik', 19, 'A'),
 (4, 'Priya', 22, 'C')]

In [14]:
%%sql
USE zomato;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [15]:
%%sql
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(1, 1, 1, 2, '123 Main St', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (2, 2, 2, 1, '456 Oak Rd', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (3, 3, 3, 3, '789 Pine Ave', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (4, 1, 1, 1, 'coimbatore', datetime.datetime(2025, 8, 21, 17, 4, 23)),
 (5, 1, 1, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (6, 1, 2, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (7, 1, 3, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (8, 1, 1, 2, '123 Main St', datetime.datetime(2025, 8, 21, 18, 56, 38)),
 (9, 2, 2, 1, '456 Oak Rd', datetime.datetime(2025, 8, 21, 18, 56, 38)),
 (10, 3, 3, 3, '789 Pine Ave', datetime.datetime(2025, 8, 21, 18, 56, 38))]

In [53]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'John', 'Doe', '123-456-7890', 'john.doe@example.com'),
 (2, 'Jane', 'Smith', '987-654-3210', 'jane.smith@example.com'),
 (3, 'Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com'),
 (4, 'Bob', 'Brown', '444-555-6666', 'bob.brown@example.com'),
 (5, 'Gowtham', 'Kumar', '777-888-9999', 'gowtham.kumar@example.com')]

In [54]:
----1. Total Revenue from All Orders----

SyntaxError: invalid syntax (2842270733.py, line 1)

In [16]:
%%sql
select * from order_items;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, 1, 1, 2, Decimal('150.00')),
 (2, 2, 2, 1, Decimal('100.00')),
 (3, 3, 3, 3, Decimal('200.00')),
 (4, 1, 1, 2, Decimal('150.00')),
 (5, 2, 2, 1, Decimal('100.00')),
 (6, 3, 3, 3, Decimal('200.00'))]

In [17]:
%%sql
SELECT SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('2000.00'),)]

In [ ]:
-----!2. Revenue by Item!----

In [18]:
%%sql
 select * from items;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, 'Biriyani', Decimal('150.00'), 2),
 (2, 'Paneer', Decimal('100.00'), 1),
 (3, 'Butter Chicken', Decimal('200.00'), 2),
 (4, 'Biriyani', Decimal('150.00'), 2),
 (5, 'Paneer', Decimal('100.00'), 1),
 (6, 'Butter Chicken', Decimal('200.00'), 2)]

In [19]:
%%sql
SELECT i.item_name,SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi join items i on oi.item_id=i.item_id
GROUP BY i.item_name ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Butter Chicken', Decimal('1200.00')),
 ('Biriyani', Decimal('600.00')),
 ('Paneer', Decimal('200.00'))]

In [ ]:
------3. Revenue by Payment Method-----

In [20]:
%%sql
select * from payments;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, 1, 'Credit Card', 'Paid', Decimal('300.00'), datetime.datetime(2025, 8, 21, 16, 43, 12)),
 (2, 2, 'Debit Card', 'Paid', Decimal('100.00'), datetime.datetime(2025, 8, 21, 16, 43, 12)),
 (3, 3, 'GPay', 'Pending', Decimal('600.00'), datetime.datetime(2025, 8, 21, 16, 43, 12)),
 (4, 1, 'Credit Card', 'Paid', Decimal('300.00'), datetime.datetime(2025, 8, 21, 18, 56, 38)),
 (5, 2, 'Debit Card', 'Paid', Decimal('100.00'), datetime.datetime(2025, 8, 21, 18, 56, 38)),
 (6, 3, 'GPay', 'Pending', Decimal('600.00'), datetime.datetime(2025, 8, 21, 18, 56, 38))]

In [21]:
%%sql
SELECT p.payment_method, SUM(p.amount) AS total_revenue
FROM payments p
JOIN orders o ON p.order_id = o.order_id
GROUP BY p.payment_method;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Credit Card', Decimal('600.00')),
 ('Debit Card', Decimal('200.00')),
 ('GPay', Decimal('1200.00'))]

In [ ]:
4.Total Revenue by Date

In [22]:
%%sql
SELECT p.paid_at, SUM(p.amount) AS total_revenue_date
FROM payments p
JOIN orders o ON p.order_id = o.order_id
GROUP BY p.paid_at;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(datetime.datetime(2025, 8, 21, 16, 43, 12), Decimal('1000.00')),
 (datetime.datetime(2025, 8, 21, 18, 56, 38), Decimal('1000.00'))]

In [ ]:
----5.Total Orders and Revenue by User-----

In [23]:
%%sql
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(1, 1, 1, 2, '123 Main St', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (2, 2, 2, 1, '456 Oak Rd', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (3, 3, 3, 3, '789 Pine Ave', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (4, 1, 1, 1, 'coimbatore', datetime.datetime(2025, 8, 21, 17, 4, 23)),
 (5, 1, 1, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (6, 1, 2, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (7, 1, 3, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (8, 1, 1, 2, '123 Main St', datetime.datetime(2025, 8, 21, 18, 56, 38)),
 (9, 2, 2, 1, '456 Oak Rd', datetime.datetime(2025, 8, 21, 18, 56, 38)),
 (10, 3, 3, 3, '789 Pine Ave', datetime.datetime(2025, 8, 21, 18, 56, 38))]

In [9]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'students.customers' doesn't exist
[SQL: select * from customers;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [24]:

%%sql
use zomato;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [25]:
%%sql
SELECT 
    u.first_name,
    u.last_name,
    u.phone_number,
    u.email,
    COUNT(o.order_id) AS total_orders,
    SUM(oi.price * oi.quantity) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers u ON o.user_id = u.user_id
GROUP BY u.user_id
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', 2, Decimal('1200.00')),
 ('John', 'Doe', '123-456-7890', 'john.doe@example.com', 2, Decimal('600.00')),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', 2, Decimal('200.00'))]

In [ ]:
------1.Items Ordered by Category------

In [79]:
%%sql
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(1, 1, 1, 2, '123 Main St', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (2, 2, 2, 1, '456 Oak Rd', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (3, 3, 3, 3, '789 Pine Ave', datetime.datetime(2025, 8, 21, 16, 41, 18)),
 (4, 1, 1, 1, 'coimbatore', datetime.datetime(2025, 8, 21, 17, 4, 23)),
 (5, 1, 1, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (6, 1, 2, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (7, 1, 3, 1, 'Madurai', datetime.datetime(2025, 8, 21, 17, 5, 49)),
 (8, 1, 1, 2, '123 Main St', datetime.datetime(2025, 8, 21, 18, 56, 38)),
 (9, 2, 2, 1, '456 Oak Rd', datetime.datetime(2025, 8, 21, 18, 56, 38)),
 (10, 3, 3, 3, '789 Pine Ave', datetime.datetime(2025, 8, 21, 18, 56, 38))]

In [26]:
%%sql
select *from categories;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, 'Vegetarian'),
 (2, 'Non-Vegetarian'),
 (3, 'Vegan'),
 (4, 'Vegetarian'),
 (5, 'Non-Vegetarian'),
 (6, 'Vegan')]

In [27]:
%%sql
select * from items;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, 'Biriyani', Decimal('150.00'), 2),
 (2, 'Paneer', Decimal('100.00'), 1),
 (3, 'Butter Chicken', Decimal('200.00'), 2),
 (4, 'Biriyani', Decimal('150.00'), 2),
 (5, 'Paneer', Decimal('100.00'), 1),
 (6, 'Butter Chicken', Decimal('200.00'), 2)]

In [32]:
%%sql
SELECT c.category_name,i.item_name,sum(o.quantity) as tatal_quantity_ordered
from orders o 
JOIN items i ON o.item_id=i.item_id
JOIN categories c ON i.category_id=c.category_id
Group by c.category_name,i.item_name
order by tatal_quantity_ordered DESC;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Non-Vegetarian', 'Butter Chicken', Decimal('7')),
 ('Non-Vegetarian', 'Biriyani', Decimal('6')),
 ('Vegetarian', 'Paneer', Decimal('3'))]

In [ ]:
-----6.Orders by Payment Status-----

In [41]:
%%sql
SELECT p.payment_status, COUNT(o.order_id) AS total_orders
FROM payments p
JOIN orders o ON p.order_id = o.order_id
GROUP BY p.payment_status;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('Paid', 4), ('Pending', 2)]

In [ ]:
------8. Users with Most Orders---------

In [49]:
%%sql
SELECT 
    u.first_name, 
    u.last_name, 
    COUNT(o.order_id) AS total_orders
FROM customers u
JOIN orders o ON u.user_id = o.user_id
GROUP BY u.user_id
ORDER BY total_orders DESC
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('John', 'Doe', 6), ('Jane', 'Smith', 2), ('Alice', 'Johnson', 2)]

In [ ]:
------9. Revenue by Category--------

In [45]:
%%sql
SELECT c.category_name, SUM(oi.price * oi.quantity) AS total_revenue
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
JOIN categories c ON i.category_id = c.category_id
GROUP BY c.category_name;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('Non-Vegetarian', Decimal('1800.00')), ('Vegetarian', Decimal('200.00'))]

In [ ]:
---------10. Items Purchased in Specific Order-------

In [46]:
%%sql
SELECT oi.order_id, i.item_name, oi.quantity, oi.price
FROM order_items oi
JOIN items i ON oi.item_id = i.item_id
WHERE oi.order_id = 1;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'Biriyani', 2, Decimal('150.00')), (1, 'Biriyani', 2, Decimal('150.00'))]

In [ ]:
------11. Customer Details with Orders+-----

In [43]:
%%sql
SELECT 
    c.first_name, 
    c.last_name, 
    c.phone_number, 
    c.email, 
    o.order_id, 
    o.delivery_address, 
    oi.item_id, 
    oi.quantity
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers c ON o.user_id = c.user_id;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[('John', 'Doe', '123-456-7890', 'john.doe@example.com', 1, '123 Main St', 1, 2),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', 2, '456 Oak Rd', 2, 1),
 ('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', 3, '789 Pine Ave', 3, 3),
 ('John', 'Doe', '123-456-7890', 'john.doe@example.com', 1, '123 Main St', 1, 2),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', 2, '456 Oak Rd', 2, 1),
 ('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', 3, '789 Pine Ave', 3, 3)]

In [ ]:
-------12. Revenue by Customer------

In [42]:
%%sql
SELECT 
    c.first_name, 
    c.last_name, 
    c.phone_number, 
    c.email, 
    SUM(oi.price * oi.quantity) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers c ON o.user_id = c.user_id
GROUP BY c.user_id
ORDER BY total_revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Alice', 'Johnson', '111-222-3333', 'alice.johnson@example.com', Decimal('1200.00')),
 ('John', 'Doe', '123-456-7890', 'john.doe@example.com', Decimal('600.00')),
 ('Jane', 'Smith', '987-654-3210', 'jane.smith@example.com', Decimal('200.00'))]